Catalogs/ТранспортныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ТранспортныеСредства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Легковые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Грузовые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спецтехника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТранспортныеСредства/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Вызывается при создании формы на сервере
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    УстановитьМаскуНомераТС();
    УстановитьПодсказки();
    
    // Настройка обязательных полей
    Элементы.НомерТС.ОтметкаНезаполненного     = Истина;
    Элементы.НомерТС.АвтоОтметкаНезаполненного = Истина;
    
    Элементы.Марка.ОтметкаНезаполненного       = Истина;
    Элементы.Марка.АвтоОтметкаНезаполненного   = Истина;
    
    Элементы.Модель.ОтметкаНезаполненного      = Истина;
    Элементы.Модель.АвтоОтметкаНезаполненного  = Истина;
КонецПроцедуры

// Вызывается при чтении данных объекта на сервере
// Форматирует НомерТС для отображения с пробелами
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    Если ЗначениеЗаполнено(ТекущийОбъект.НомерТС) Тогда
        Если ТекущийОбъект.ТипТС = Перечисления.ТипыТС.Легковые 
            ИЛИ ТекущийОбъект.ТипТС = Перечисления.ТипыТС.Грузовые Тогда
            Если СтрДлина(ТекущийОбъект.НомерТС) = 8 Тогда // 1 буква, 3 цифры, 2 буквы, 2 цифры региона
                ТекущийОбъект.НомерТС = Лев(ТекущийОбъект.НомерТС, 4) + " " + 
                                        Сред(ТекущийОбъект.НомерТС, 5, 2) + " " + 
                                        Прав(ТекущийОбъект.НомерТС, 2);
            ИначеЕсли СтрДлина(ТекущийОбъект.НомерТС) = 9 Тогда // 1 буква, 3 цифры, 2 буквы, 3 цифры региона
                ТекущийОбъект.НомерТС = Лев(ТекущийОбъект.НомерТС, 4) + " " + 
                                        Сред(ТекущийОбъект.НомерТС, 5, 2) + " " + 
                                        Прав(ТекущийОбъект.НомерТС, 3);
            КонецЕсли;
        ИначеЕсли ТекущийОбъект.ТипТС = Перечисления.ТипыТС.Спецтехника Тогда
            Если СтрДлина(ТекущийОбъект.НомерТС) = 6 Тогда
                ТекущийОбъект.НомерТС = Лев(ТекущийОбъект.НомерТС, 2) + " " + 
                                        Прав(ТекущийОбъект.НомерТС, 4);
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;
    
    УстановитьМаскуНомераТС();
    УстановитьПодсказки();
КонецПроцедуры

// Вызывается при изменении поля ТипТС на клиенте
// Обновляет маску и подсказки в зависимости от выбранного типа ТС
&НаКлиенте
Процедура ТипТСПриИзменении(Элемент)
    УстановитьМаскуНомераТС();
    УстановитьПодсказки();
КонецПроцедуры

// Устанавливает маску ввода для поля НомерТС в зависимости от ТипТС
// Вызывается на сервере
&НаСервере
Процедура УстановитьМаскуНомераТС()
    Если Объект.ТипТС = Перечисления.ТипыТС.Легковые 
        ИЛИ Объект.ТипТС = Перечисления.ТипыТС.Грузовые Тогда
        // Маска: буква (А, В, Е, К, М, Н, О, Р, С, Т, У, Х), 3 цифры, 2 буквы, 2-3 цифры региона
        Элементы.НомерТС.Маска = "[АВЕКМНОРСТУХ][0-9][0-9][0-9] [АВЕКМНОРСТУХ][АВЕКМНОРСТУХ] [0-9][0-9][0-9&&0-9]";
    ИначеЕсли Объект.ТипТС = Перечисления.ТипыТС.Спецтехника Тогда
        // Маска: 2 буквы, 4 цифры
        Элементы.НомерТС.Маска = "[A-ZА-Я][A-ZА-Я] [0-9][0-9][0-9][0-9]";
    Иначе
        Элементы.НомерТС.Маска = "";
    КонецЕсли;
КонецПроцедуры

// Устанавливает подсказки для полей ввода в зависимости от ТипТС
// Вызывается на сервере
&НаСервере
Процедура УстановитьПодсказки()
    Если Объект.ТипТС = Перечисления.ТипыТС.Легковые Тогда
        Элементы.НомерТС.ПодсказкаВвода = "Например: С065МК 78";
    ИначеЕсли Объект.ТипТС = Перечисления.ТипыТС.Грузовые Тогда
        Элементы.НомерТС.ПодсказкаВвода = "Например: В456ЕС 199";
    ИначеЕсли Объект.ТипТС = Перечисления.ТипыТС.Спецтехника Тогда
        Элементы.НомерТС.ПодсказкаВвода = "Например: СК 8975";
    Иначе
        Элементы.НомерТС.ПодсказкаВвода = "Выберите тип ТС";
    КонецЕсли;

    Элементы.Марка.ПодсказкаВвода  = "Например: Toyota";
    Элементы.Модель.ПодсказкаВвода = "Например: Camry";
КонецПроцедуры
